app/views/boards/show.html.erb

<div class="flex space-x-4">
  <% board.columns.each do |column| %>
---
SELECT "columns".* FROM "columns" WHERE "columns"."board_id" = $1  [["board_id", 1]]


      <% column.tasks.each do |task| %>
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."column_id" = $1  [["column_id", 1]]