app/controllers/boards_controller.rb

  def board
    @board ||= Board.find(board_params[:id])
---
SELECT "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]