app/controllers/tasks_controller.rb

  def task
    @task ||= Task.find(task_params[:id])
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]